Repository: MahmoudSherif28/Iman
Catalog: lib/l10n/intl_*.arb
Languages: ar

# onboarding_title1
source: Everything you need for your prayer: times, adhan, and Qibla direction
ar: كل ما تحتاجه لصلاتك: مواقيت، أذان، واتجاه القبلة

# onboarding_title2
source: Everything you need for your prayer: times, adhan, and Qibla direction
ar: كل ما تحتاجه لصلاتك: مواقيت، أذان، واتجاه القبلة

# onboarding_title3
source: All your daily adhkar in one place with reminders at the right time
ar: كل أذكارك في مكان واحد مع تذكيرك بها في وقتها

# home_icon1
source: Qur'an
ar: القرآن

# home_icon2
source: Qur'an Recitation
ar: تسميع القرآن

# home_icon3
source: Qur'an Listening
ar: استماع القرآن

# home_icon4
source: Dhikr & Tasbeeh
ar: أذكار و تسبيح

# home_icon5
source: Prayer Times
ar: مواعيد الصلاة

# home_icon6
source: Qibla
ar: القبلة

source: Next Prayer
ar: الصلاة القادمة

source: Qibla
ar: القبلة

source: Qibla Direction
ar: اتجاه القبلة

# pointTowardsQibla
source: Point your device towards the Qibla
ar: وجه هاتفك نحو القبلة

source: Qibla Angle
ar: زاوية القبلة

source: Retry
ar: إعادة المحاولة

# azkar_title
source: Adhkar & Duas
ar: الأذكار والأدعية

# azkar_counter
source: Counter
ar: العداد

# azkar_reset
source: Reset
ar: إعادة ضبط

# azkar_complete
source: Done
ar: تم

# azkar_category_morning
source: Morning Adhkar
ar: أذكار الصباح

# azkar_category_evening
source: Evening Adhkar
ar: أذكار المساء

# azkar_category_after_prayer
source: After Prayer Adhkar
ar: أذكار بعد الصلاة

# azkar_category_before_sleep
source: Before Sleep Adhkar
ar: أذكار قبل النوم

# azkar_category_general
source: General Adhkar
ar: أذكار عامة

# azkar_category_dua
source: Duas
ar: أدعية مأثورة

# azkar_morning_1
source: Ayat al-Kursi (The Throne Verse) Allah! There is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great. (Al-Baqarah: 255)
ar: آية الكرسي اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ (البقرة: 255)

# azkar_morning_2
source: Last two verses of Surah Al-Baqarah The Messenger has believed in what was revealed to him from his Lord, and the believers. All of them have believed in Allah and His angels and His books and His messengers. We make no distinction between any of His messengers. And they say, 'We hear and we obey. Your forgiveness, our Lord, and to You is the return.' Allah does not charge a soul except with that within its capacity. It will have what it has gained, and it will bear what it has lost. Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people. (Al-Baqarah: 285-286)
ar: آخر آيتين من سورة البقرة آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ (البقرة: 285-286)

# azkar_morning_3
source: Surah Al-Ikhlas and Al-Mu'awwidhatain (3 times) Say, 'He is Allah, [who is] One.' Say, 'I seek refuge in the Lord of daybreak.' Say, 'I seek refuge in the Lord of mankind.'
ar: سورة الإخلاص والمعوذتين (3 مرات) سورة الإخلاص بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ سورة الفلق بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ مِن شَرِّ مَا خَلَقَ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ سورة الناس بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ أَعُوذُ بِرَبِّ النَّاسِ مَلِكِ النَّاسِ إِلَٰهِ النَّاسِ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ مِنَ الْجِنَّةِ وَالنَّاسِ

# azkar_morning_4
source: We have reached the morning and at this very time all sovereignty belongs to Allah We have reached the morning and at this very time all sovereignty belongs to Allah, and all praise is for Allah. None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. O Lord, I ask You for the good of this day and the good of what follows it. And I seek refuge in You from the evil of this day and the evil of what follows it. O Lord, I seek refuge in You from laziness and old age. O Lord, I seek refuge in You from punishment in the Fire and punishment in the grave.
ar: أصبحنا وأصبح الملك لله أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير هذا اليوم وخير ما بعده، وأعوذ بك من شر هذا اليوم وشر ما بعده، رب أعوذ بك من الكسل وسوء الكبر، رب أعوذ بك من عذاب في النار وعذاب في القبر.

# azkar_morning_5
source: O Allah, by You we have reached the morning and by You we have reached the evening O Allah, by You we have reached the morning and by You we have reached the evening, and by You we live and by You we die, and to You is the return.
ar: اللهم بك أصبحنا وبك أمسينا اللهم بك أصبحنا وبك أمسينا، وبك نحيا وبك نموت وإليك النشور.

# azkar_morning_6
source: O Allah, I have reached the morning bearing witness to You (4 times) O Allah, I have reached the morning bearing witness to You, and bearing witness to the bearers of Your Throne, and Your angels and all of Your creation, that You are Allah, there is no deity except You, alone, without partner, and that Muhammad is Your servant and Your messenger.
ar: اللهم إني أصبحت أشهدك (4 مرات) اللهم إني أصبحت أشهدك، وأشهد حملة عرشك، وملائكتك وجميع خلقك أنك أنت الله، لا إله إلا أنت وحدك لا شريك لك، وأن محمداً عبدك ورسولك.

# azkar_morning_7
source: O Allah, whatever blessing I have reached this morning O Allah, whatever blessing I have reached this morning or any of Your creation has reached, it is from You alone, without partner, so for You is all praise and unto You all thanks.
ar: اللهم ما أصبح بي من نعمة اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر.

# azkar_morning_8
source: Allah is sufficient for me, there is no deity except Him, upon Him I rely and He is the Lord of the Great Throne (7 times)
ar: حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم (7 مرات)

# azkar_morning_9
source: In the name of Allah, with whose name nothing can harm on earth or in heaven, and He is the Hearing, the Knowing (3 times)
ar: بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم (3 مرات)

# azkar_morning_10
source: I am pleased with Allah as a Lord, and with Islam as a religion, and with Muhammad as a Prophet (3 times)
ar: رضيت بالله رباً وبالإسلام ديناً وبمحمد ﷺ نبياً (3 مرات)

# azkar_morning_11
source: O Ever-Living, O Self-Sustaining, by Your mercy I seek help Set right for me all my affairs, and do not leave me to myself for the blink of an eye.
ar: يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين.

# azkar_morning_12
source: We have reached the morning upon the natural religion of Islam We have reached the morning upon the natural religion of Islam, and upon the word of sincerity, and upon the religion of our Prophet Muhammad, and upon the religion of our father Abraham, inclining toward truth, and he was not of the polytheists.
ar: أصبحنا على فطرة الإسلام أصبحنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد ﷺ، وعلى ملة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين.

# azkar_morning_13
source: Glory is to Allah and praise is to Him (100 times)
ar: سبحان الله وبحمده (100 مرة)

# azkar_morning_14
source: None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent (100 times)
ar: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير (100 مرة)

# azkar_evening_1
source: We have reached the evening and at this very time all sovereignty belongs to Allah. Praise is to Allah. None has the right to be worshipped except Allah, alone, without partner. To Him belongs all sovereignty and praise, and He is over all things omnipotent.
ar: آية الكرسي اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ (البقرة: 255)

# azkar_evening_2
source: O Allah, what blessing I or any of Your creation have risen upon, is from You alone, without partner, so for You is all praise and unto You all thanks.
ar: آخر آيتين من سورة البقرة آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ (البقرة: 285-286)

# azkar_evening_3
source: O Allah, I take refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being overpowered by men.
ar: سورة الإخلاص والمعوذتين (3 مرات) سورة الإخلاص بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ سورة الفلق بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ مِن شَرِّ مَا خَلَقَ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ سورة الناس بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ قُلْ أَعُوذُ بِرَبِّ النَّاسِ مَلِكِ النَّاسِ إِلَٰهِ النَّاسِ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ مِنَ الْجِنَّةِ وَالنَّاسِ

# azkar_after_prayer_1
source: I ask Allah for forgiveness (three times). O Allah, You are As-Salam and from You is all peace, blessed are You, O Possessor of majesty and honor.
ar: أَسْتَغْفِرُ اللهَ (ثلاثاً) اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ

# azkar_after_prayer_2
source: None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty.
ar: لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ

# azkar_after_prayer_3
source: Glory is to Allah (33 times). Praise is to Allah (33 times). Allah is the greatest (33 times). None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.
ar: سُبْحَانَ اللهِ (٣٣ مرة) الْحَمْدُ لِلهِ (٣٣ مرة) اللهُ أَكْبَرُ (٣٣ مرة) لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ

# azkar_before_sleep_1
source: In Your name O Allah, I die and I live.
ar: بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا

# azkar_before_sleep_2
source: O Allah, protect me from Your punishment on the day Your servants are resurrected.
ar: اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ

# azkar_before_sleep_3
source: Glory is to Allah (33 times). Praise is to Allah (33 times). Allah is the greatest (34 times).
ar: سُبْحَانَ اللَّهِ (٣٣ مرة) الْحَمْدُ لِلَّهِ (٣٣ مرة) اللَّهُ أَكْبَرُ (٣٤ مرة)

# azkar_general_1
source: Glory is to Allah and praise is to Him.
ar: سُبْحَانَ اللهِ وَبِحَمْدِهِ

# azkar_general_2
source: None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.
ar: لا إلهَ إلاّ اللهُ وحدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحمدُ وهوَ على كلّ شيءٍ قديرٌ

# azkar_general_3
source: Glory is to Allah and praise is to Him, Glory is to Allah the Greatest.
ar: سُبْحَانَ اللهِ وَبِحَمْدِهِ، سُبْحَانَ اللهِ العَظِيمِ

# azkar_dua_1
source: Our Lord, give us in this world that which is good and in the Hereafter that which is good and protect us from the punishment of the Fire.
ar: رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ

# azkar_dua_2
source: O Allah, I ask You for guidance, piety, chastity and contentment.
ar: اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى، وَالْعَفَافَ وَالْغِنَى

# azkar_dua_3
source: O Allah, forgive me, have mercy upon me, guide me, give me health and grant me sustenance.
ar: اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي، وَارْزُقْنِي
